https://leetcode.com/problems/second-highest-salary/

In [1]:
import pandas as pd
import numpy as np 
import sqlite3

In [2]:
sql = '''
Create table If Not Exists Employee (id int, salary int);
---Truncate table Employee
insert into Employee (id, salary) values ('1', '100');
insert into Employee (id, salary) values ('2', '200');
insert into Employee (id, salary) values ('3', '300');
insert into Employee (id, salary) values ('4', '300');
'''

In [3]:
def select(sql):
    return pd.read_sql(sql, con)

In [4]:
con = sqlite3.connect('db')

In [5]:
cur = con.cursor()

In [6]:
cur.executescript(sql)

In [11]:
sql = '''
SELECT *
FROM Employee AS t
'''

In [12]:
select(sql)

   id  salary
0   1     100
1   2     200
2   3     300
3   4     300

In [33]:
sql = '''
SELECT max(t.salary) AS second_highest_salary
FROM
    (SELECT t.*,
        dense_rank() OVER (ORDER BY t.salary DESC) AS rnk
        FROM Employee AS t) AS t
    
WHERE t.rnk = 2
'''

In [34]:
select(sql)

   second_highest_salary
0                    200

In [48]:
sql = '''
SELECT max(t.salary) as second_highest_salary
FROM Employee AS t
WHERE t.salary NOT IN(
    SELECT max(t.salary)
    FROM Employee AS t
    )
'''

In [49]:
select(sql)

   second_highest_salary
0                    200